Merge pull request #673 from geobtaa/resource-lifecycle
update resource lifecycle documentation
