--- a/docs/resource-lifecycle.md
+++ b/docs/resource-lifecycle.md
@@ -30,70 +36,79 @@ This step involves using a crosswalk to convert the metadata into the schema nee
+<!--
+plantUML code for the sequence chart
+
+@startuml
+!theme mars
+actor "Team Member" as TM
+actor "Product Manager" as PM
+participant "GitHub" as GH
+actor "Research Assistant" as RA
+participant "GBL Admin" as GBL
 
 
-##  Sequence diagram of Resource Lifecycle
 
-``` mermaid
+TM -> PM : Submit Resources
+PM -> GH : Create GitHub issue
+GH -> RA : Assign issue
 
-	
-	
 
-	sequenceDiagram
-   		actor Team Member
-    		actor Product Manager
-    		participant GitHub
-    		actor Research Assistant
-    		participant GBL Admin
-    		participant Geoportal	
-    			
-    		
-    		Note right of Team Member:  IDENTIFY
-    		 
-    		Team Member->>Product Manager: Submit Resources
-    		Product Manager->>GitHub: Create GitHub issue
-    		GitHub ->>Research Assistant: Assign issue
-    		Note left of Research Assistant:  HARVEST
-    		Note left of Research Assistant:  EDIT 
-    		
-    		Research Assistant->>GBL Admin: Upload records
-    		Research Assistant ->>GitHub: Update GitHub issue
-    		Note right of GBL Admin:  PUBLISH 
-    		
-    		Product Manager->>GBL Admin: Publish records
-    		GBL Admin->>Geoportal: Send records online 
-    		Product Manager->>GitHub: Close GitHub issue
-    		Product Manager ->> Team Member: Share link to published records
-    		
-    		Note left of Research Assistant:  MAINTAIN 
-    		
-```
+RA -> GBL : Upload completed records
+RA -> GH : Update GitHub issue
+GH -> PM : Notify readiness
 
+
+PM -> GBL : Publish records
+PM -> GH : Close GitHub issue
+PM -> TM : Share link to published records
+@enduml-->
